org/2014-09-19-linux-system-management.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+OPTIONS:   H:2 num:nil toc:nil \n:nil ::t |:t -:t f:t *:t <:t

#+OPTIONS:   tex:t  d:nil todo:t pri:nil tags:not-in-toc
#+BEGIN_HTML
---
layout: post
title: "General Knowledge of Linux System Management"
description: ""
tags: [linux, tools]
---
{% include JB/setup %}

#+END_HTML

* 将find找到的所有文件使用cp拷贝 到指定的目录
find ./openfiler/ -name "*.php" -exec cp {} ./NAS-storage/ \;

+ -exec 参数后面跟的是 command 命令(如这里的cp)，
+ '{}'  使用{}来表示文件名，也就是find前面处理过程中过滤出来的文件，用于command命令进行处理
+ ;  command命令的终止，使用 ';' (分号）来判定，在后面必须有一个';',分号前必须有空格；对于不同的系统，直接使用分号可能会有不同的意义， 使用转义符 '\'在分号前明确说明，对于前面我们遇到的问题，主要就是这个原因引起的！
* RJ45
以下内容摘自wikipedia

1. 差分传输是一种信号传输的技术，区别于传统的一根信号线一根地线的做法，差分传输在这两根线上都传输信号，这两个信号的振幅相等，相位相反。在这两根线上的传输的信号就是差分信号。信号接收端比较这两个电压的差值来判断发送端发送的是逻辑0还是逻辑1。在电路板上，差分走线必须是等长、等宽、紧密靠近、且在同一层面的两根线。

2. 8P8C，也称之为RJ45，是以太网使用双绞线连接时常用的连接器插头。 8P8C的意义是8个位置（Position）也就是8个凹槽，8个触点（Contact）也就是8个金属接点。

连线颜色

在T568A中，与之相连的8根线分别定义为：绿白、绿；橙白、蓝；蓝白、橙；棕白、棕。在T568B中，与之相连的8根线分别定义为：橙白、橙；绿白、蓝；蓝白、绿；棕白、棕。其中橙白色和橙色组成一对差分传输线，绿白色和绿色组成一对差分传输线，蓝白色和蓝色组成一对差分传输线，棕白色和棕色组成一对差分传输线。T568A可以跟早期的USOC向下兼容，The United States National Communication Systems Federal Telecommunications Recommendations 不使用 T568B。

连线信号

在百兆以太网中，仅适用1、2、3、6四根线,差分信号传输方式，减少电磁干扰，其中1、2为TX(发送)（拧在一起），3、6为RX（接收）拧在一起。因此直连线就是两端同为EIA-568-A或者EIA-568-B，而以太网交叉线就是一端使用EIA-568-A，另一端使用EIA-568-B的连接方法。

在千兆以太网或者以太网供电中，全部的四对差分对都被使用。

T568B是RJ45端口连接双绞线时使用的一种线序，又称TIA/EIA-568-B线序: 橙白 橙 绿白 蓝 蓝白 绿 棕白 棕

T568A是RJ45端口连接双绞线时使用的一种线序，又称TIA/EIA-568-A线序：绿白 绿 橙白 蓝 蓝白 橙 棕白 棕


* 配置 SSH 的无密码公钥认证的过程,需要如下操作

如下步骤都应该在本地主机(192.168.1.103)终端命令行上执行，不要在emacs的shell中执行

#+BEGIN_SRC sh
ssh-keygen -t rsa
cat ~/.ssh/id_rsa.pub >> ~/.ssh/authorized_keys
#+END_SRC

完成后，将公钥拷贝到要登录的远程主机(192.168.1.107)上：

#+BEGIN_SRC sh
[abelard@localhost ~]$ ssh-copy-id -i ~/.ssh/id_rsa.pub 192.168.1.107
#+END_SRC

现在就可以无密码登录到远程主机上了，只是用户名必须是同一个，(网路上提议拷贝
时用borealis@192.168.1.107，但是试验没有成功。)
#+BEGIN_SRC sh
ssh -l abelard192.168.0.88
#+END_SRC


如果这时候出现如下错误：
#+begin_example
Agent admitted failure to sign using the key
#+end_example
使用下面的方法：
#+begin_example
ssh-add   ~/.ssh/id_rsa  
#+end_example

* 建立 ssh 连接,只要將公鑰複製到 ~/.ssh/authorized\_keys 就可以利用金鑰登入,而不需要建立密碼.如出现下面的错误？

Agent admitted failure to sign using the key

解決方式 使用 ssh-add 指令將私钥加進來 （根据个人的密匙命名不同更改 id\_rsa）
# ssh-add   ~/.ssh/id_rsa  
* 按照步骤配置完无密码ssh登录后，使用ssh登录，还是需要密码，怎么办？
很可能是因为authorized_keys 文件的权限不对，使用下面的命令改为：
#+begin_example
[abelard@dillon82 ~]$ chmod 600 .ssh/authorized_keys 
#+end_example
