_posts/2014-09-19-linux-system-management.html
---
layout: post
title: "linux system management"
tagline: "linux"
description: "linux system "
tags: ["tools"]
---
{% include JB/setup %}
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">将find找到的所有文件使用cp拷贝 到指定的目录</a></li>
<li><a href="#sec-2">配置 SSH 的无密码公钥认证的过程,需要如下操作</a></li>
<li><a href="#sec-3">建立 ssh 连接,只要將公鑰複製到 ~/.ssh/authorized\<sub>keys</sub> 就可以利用金鑰登入,而不需要建立密碼.如出现下面的错误？</a></li>
<li><a href="#sec-4">按照步骤配置完无密码ssh登录后，使用ssh登录，还是需要密码，怎么办？</a></li>
<li><a href="#sec-5">怎么让qemu的guest os通过host 的bridge上网以及让guest os 在host所在的局域网内 (主机操作系统为 Fedora 16 x86\<sub>64</sub>)</a></li>
<li><a href="#sec-6">使用vnc来显示qemu客户OS</a></li>
<li><a href="#sec-7">使用rsync命令从一台机器的内容同步到另一台机器时，会出现用户名和组名为数字</a></li>
<li><a href="#sec-8">为linux安装新的字体(环境为Fedora 12 x86<sub>64</sub>)</a></li>
<li><a href="#sec-9">架设dns服务器(环境为Fedora 12 x86<sub>64</sub>)</a></li>
<li><a href="#sec-10">查看已安装的perl模块</a></li>
<li><a href="#sec-11">列出目前在cpan中可用的模块</a></li>
<li><a href="#sec-12">安装perl模块(已安装MediaWikiDump为例)</a></li>
<li><a href="#sec-13">perl模块的卸载</a></li>
<li><a href="#sec-14">查看linux下某个端口被哪个程序占用,如想查看端口为5000被谁占用</a></li>
<li><a href="#sec-15">用yum安装rpm文件</a></li>
<li><a href="#sec-16">diff</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">将find找到的所有文件使用cp拷贝 到指定的目录</h2>
<div class="outline-text-2" id="text-1">
<p>
find ./openfiler/ -name "*.php" -exec cp {} ./NAS-storage/ \;
</p>

<p>
(1)-exec 参数后面跟的是 command 命令(如这里的cp)，
(2)'{}'  使用{}来表示文件名，也就是find前面处理过程中过滤出来的文件，用于command命令进行处理
(3);  command命令的终止，使用 ';' (分号）来判定，在后面必须有一个
';',分号前必须有空格；对于不同的系统，直接使用分号可能会有不
同的意义， 使用转义符 '\'在分号前明确说明，对于前面我们遇到
的问题，主要就是这个原因引起的！
2.RJ45
以下内容摘自wikipedia
</p>

<ol class="org-ol">
<li>差分传输是一种信号传输的技术，区别于传统的一根信号线一根地线的做法，差分传输在这两根线上都传输信号，这两个信号的振幅相等，相位相反。在这两根线上的传输的信号就是差分信号。信号接收端比较这两个电压的差值来判断发送端发送的是逻辑0还是逻辑1。在电路板上，差分走线必须是等长、等宽、紧密靠近、且在同一层面的两根线。
</li>

<li>8P8C，也称之为RJ45，是以太网使用双绞线连接时常用的连接器插头。 8P8C的意义是8个位置（Position）也就是8个凹槽，8个触点（Contact）也就是8个金属接点。
</li>
</ol>

<p>
连线颜色
</p>

<p>
在T568A中，与之相连的8根线分别定义为：绿白、绿；橙白、蓝；蓝白、橙；棕白、棕。在T568B中，与之相连的8根线分别定义为：橙白、橙；绿白、蓝；蓝白、绿；棕白、棕。其中橙白色和橙色组成一对差分传输线，绿白色和绿色组成一对差分传输线，蓝白色和蓝色组成一对差分传输线，棕白色和棕色组成一对差分传输线。T568A可以跟早期的USOC向下兼容，The United States National Communication Systems Federal Telecommunications Recommendations 不使用 T568B。
</p>

<p>
连线信号
</p>

<p>
在百兆以太网中，仅适用1、2、3、6四根线,差分信号传输方式，减少电磁干扰，其中1、2为TX(发送)（拧在一起），3、6为RX（接收）拧在一起。因此直连线就是两端同为EIA-568-A或者EIA-568-B，而以太网交叉线就是一端使用EIA-568-A，另一端使用EIA-568-B的连接方法。
</p>

<p>
在千兆以太网或者以太网供电中，全部的四对差分对都被使用。
</p>

<p>
T568B是RJ45端口连接双绞线时使用的一种线序，又称TIA/EIA-568-B线序: 橙白 橙 绿白 蓝 蓝白 绿 棕白 棕
</p>

<p>
T568A是RJ45端口连接双绞线时使用的一种线序，又称TIA/EIA-568-A线序：绿白 绿 橙白 蓝 蓝白 橙 棕白 棕
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">配置 SSH 的无密码公钥认证的过程,需要如下操作</h2>
<div class="outline-text-2" id="text-2">
<p>
如下步骤都应该在本地主机(192.168.1.103)终端命令行上执行，不要在emacs的shell中执行
</p>

<div class="org-src-container">

<pre class="src src-sh">ssh-keygen -t rsa
cat ~/.ssh/id_rsa.pub &gt;&gt; ~/.ssh/authorized_keys
</pre>
</div>

<p>
完成后，将公钥拷贝到要登录的远程主机(192.168.1.107)上：
</p>

<div class="org-src-container">

<pre class="src src-sh">[abelard@localhost ~]$ ssh-copy-id -i ~/.ssh/id_rsa.pub 192.168.1.107
</pre>
</div>

<p>
现在就可以无密码登录到远程主机上了，只是用户名必须是同一个，(网路上提议拷贝
时用borealis@192.168.1.107，但是试验没有成功。)
</p>
<div class="org-src-container">

<pre class="src src-sh">ssh -l abelard192.168.0.88
</pre>
</div>


<p>
如果这时候出现如下错误：
</p>
<pre class="example">
Agent admitted failure to sign using the key
</pre>
<p>
使用下面的方法：
</p>
<pre class="example">
ssh-add   ~/.ssh/id_rsa
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">建立 ssh 连接,只要將公鑰複製到 ~/.ssh/authorized\<sub>keys</sub> 就可以利用金鑰登入,而不需要建立密碼.如出现下面的错误？</h2>
<div class="outline-text-2" id="text-3">
<p>
Agent admitted failure to sign using the key
</p>

<p>
解決方式 使用 ssh-add 指令將私钥加進來 （根据个人的密匙命名不同更改 id\<sub>rsa）</sub>
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">按照步骤配置完无密码ssh登录后，使用ssh登录，还是需要密码，怎么办？</h2>
<div class="outline-text-2" id="text-4">
<p>
很可能是因为authorized<sub>keys</sub> 文件的权限不对，使用下面的命令改为：
</p>
<pre class="example">
[abelard@dillon82 ~]$ chmod 600 .ssh/authorized_keys
</pre>
</div>
</div>
