_posts/2014-09-19-linux-system-management.html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">怎么让qemu的guest os通过host 的bridge上网以及让guest os 在host所在的局域网内 (主机操作系统为 Fedora 16 x86\<sub>64</sub>)</h2>
<div class="outline-text-2" id="text-5">
<p>
说明：使用qemu的网桥模式，这样由qemu创建的guest os和
主机操作系统在同一个局域网内，即局域网内的所有主机都可以访问
该guest os。当然由于网桥可以在直接网桥方式和NAT/Masquerading
方式下工作，因此guest 和 host可以在同一个子网内（直接桥接方
式）也可以将guest隐藏起来，不与host在同一个子网，如下图
(<a href="http://en.gentoo-wiki.com/wiki/KVM#Networking_2">http://en.gentoo-wiki.com/wiki/KVM#Networking_2</a>)。
</p>

<p>
直接网桥模式:
</p>
<pre class="example">
                     host   
          +-----------------------+
          |                       |                             
	  |                       |        KVM GUEST1
          |  +-----------+        |     +--------------+ 
LAN ------+--+---  eth0  |   +----------+---  nic0     |      
          |  |     tap0 -----+    |     | 192.168.0.83 |      KVM GUEST2         
          |  |     tap1 -----+    |     +--------------+  +--------------+
          |  +-----------+   |    |                       |              |
          |          br0     +----+-----------------------+---- nic0     |
          |    192.168.0.88       |                       | 192.168.0.84 |
          +-----------------------+                       +--------------+
</pre>

<p>
NAT/Masquerading （网络地址转换/隐藏）网桥模式:
</p>
<pre class="example">
                     host   
          +-----------------------+
	  |                       |        KVM GUEST1
          |   192.168.1.88        |     +--------------+ 
LAN ------+-----  eth0            |     |              |
          |        ^              |     |              |
          |        |              |     |              |
          |  +-----------+   +----+-----+-----nic0     |   
          |  |     tap0 -----+    |     | 192.168.0.83 |      KVM GUEST2         
          |  |     tap1 -----+    |     +--------------+  +--------------+
          |  +-----------+   |    |                       |              |
          |          br0     +----+-----------------------+---- nic0     |
          |    192.168.0.88       |                       | 192.168.0.84 |
          +-----------------------+                       +--------------+
</pre>

<p>
第一步：安装和设置网桥（参考<a href="http://www.howtoforge.com/virtualization-with-kvm-on-a-fedora-14-server">Virtualization With KVM On A Fedora 14 Server</a>)
</p>

<ol class="org-ol">
<li>安装网桥和准备工作
</li>
</ol>
<pre class="example">
yum install bridge-utils
</pre>
<p>
为了让网桥顺利工作，需要关闭Network Manager，因为Network Manager好像不
支持网桥启动，可以先查看Network Manager是否启动，由于从Fedora14以后，
采用了<a href="http://freedesktop.org/wiki/Software/systemd">Systemd</a> 作为linux的系统和服务管理器，因此查看和关闭服务使用：
</p>
<pre class="example">
systemctl status networkmanager.service
systemctl stop networkmanager.service
</pre>
<p>
永久关闭该服务使用：
</p>
<pre class="example">
chkconfig NetworkManager off
chkconfig --levels 35 network on
</pre>
<p>
这时候重启网络，看看什么情况
</p>
<pre class="example">
systemctl restart network.service
</pre>
<ol class="org-ol">
<li>开始配置网卡和网桥
</li>
</ol>
<p>
/etc/sysconfig/network-scripts/ifcfg-p4p1的内容如下：重点需要关注的是
这里的NM<sub>CONTROLLED</sub>="no",而不是"yes"，就是说要关闭network manager，另
外就是加上了BRIDGE=br0。 (至于为什么是p4p1
不是eth0等，那是fedora新版本采用的名称)
</p>
<pre class="example">
DEVICE=p4p1
#BOOTPROTO=static
ONBOOT=yes
NM_CONTROLLED="no"
TYPE=Ethernet
DEFROUTE=yes
IPV4_FAILURE_FATAL=yes
IPV6INIT=no
NAME="System p4p1"
UUID=5dd47203-fffb-671a-4fd0-4cff98347a3b
HWADDR=00:25:64:8E:58:8C
PREFIX0=24
BRIDGE=br0
</pre>
<p>
还需要配置网桥，使用/etc/sysconfig/network-scripts/ifcfg-br0文件来完成，
可以看到该文件中配置了ip,gateway,dns等
</p>
<pre class="example">
DEVICE=br0
TYPE=Bridge
BOOTPROTO=static
ONBOOT=yes
IPADDR=192.168.0.88
NETMASK=255.255.255.0
GATEWAY=192.168.0.1
DNS1=192.168.0.1
DELAY=0
STP=off
</pre>
<p>
这时候重启网络
</p>
<pre class="example">
systemctl restart network.service
</pre>
<p>
正常的情况下应该看到如下信息：
</p>
<pre class="example">
[abelard@localhost ~]$ ifconfig
br0       Link encap:Ethernet  HWaddr 00:25:64:8E:58:8C  
          inet addr:192.168.0.88  Bcast:192.168.0.255  Mask:255.255.255.0
          inet6 addr: fe80::225:64ff:fe8e:588c/64 Scope:Link
          UP BROADCAST RUNNING MULTICAST  MTU:1500  Metric:1
          RX packets:11611 errors:0 dropped:0 overruns:0 frame:0
          TX packets:10348 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:0 
          RX bytes:8935226 (8.5 MiB)  TX bytes:1445532 (1.3 MiB)

lo        Link encap:Local Loopback  
          inet addr:127.0.0.1  Mask:255.0.0.0
          inet6 addr: ::1/128 Scope:Host
          UP LOOPBACK RUNNING  MTU:16436  Metric:1
          RX packets:8 errors:0 dropped:0 overruns:0 frame:0
          TX packets:8 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:0 
          RX bytes:480 (480.0 b)  TX bytes:480 (480.0 b)

p4p1      Link encap:Ethernet  HWaddr 00:25:64:8E:58:8C  
          inet6 addr: fe80::225:64ff:fe8e:588c/64 Scope:Link
          UP BROADCAST RUNNING MULTICAST  MTU:1500  Metric:1
          RX packets:12061 errors:0 dropped:0 overruns:0 frame:0
          TX packets:10384 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:1000 
          RX bytes:9225251 (8.7 MiB)  TX bytes:1497788 (1.4 MiB)
          Interrupt:16
</pre>
<p>
可以使用nslookup www.google.com命令看看是否有问题！
</p>

<p>
第二步，创建tap设备
  有了网桥以后，先使用
</p>
<pre class="example">
[abelard@localhost ~]$ sudo lsmod | grep tun
</pre>
<p>
如果没有任何信息，使用
</p>
<pre class="example">
[abelard@localhost ~]$ sudo modprobe tun
[abelard@localhost ~]$ sudo lsmod | grep tun
tun                    14111  0
</pre>
<p>
如果还没有信息，就需要google一下，查找怎么yum一个tun模块。有信息的话，
就继续。
使用tunctl命令创建tap设备,并将tap设备添加到网桥br0中，
</p>
<pre class="example">
[abelard@localhost ~]$ sudo tunctl -b  -t tap0
[abelard@localhost ~]$ brctl addif br0 tap0
[abelard@localhost ~]$ sudo ifconfig tap0 up
[abelard@localhost ~]$ ifconfig
br0       Link encap:Ethernet  HWaddr 00:25:64:8E:58:8C  
          inet addr:192.168.0.88  Bcast:192.168.0.255  Mask:255.255.255.0
          inet6 addr: fe80::225:64ff:fe8e:588c/64 Scope:Link
          UP BROADCAST RUNNING MULTICAST  MTU:1500  Metric:1
          RX packets:12165 errors:0 dropped:0 overruns:0 frame:0
          TX packets:10867 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:0 
          RX bytes:9116034 (8.6 MiB)  TX bytes:1529806 (1.4 MiB)

lo        Link encap:Local Loopback  
          inet addr:127.0.0.1  Mask:255.0.0.0
          inet6 addr: ::1/128 Scope:Host
          UP LOOPBACK RUNNING  MTU:16436  Metric:1
          RX packets:8 errors:0 dropped:0 overruns:0 frame:0
          TX packets:8 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:0 
          RX bytes:480 (480.0 b)  TX bytes:480 (480.0 b)

p4p1      Link encap:Ethernet  HWaddr 00:25:64:8E:58:8C  
          inet6 addr: fe80::225:64ff:fe8e:588c/64 Scope:Link
          UP BROADCAST RUNNING MULTICAST  MTU:1500  Metric:1
          RX packets:12677 errors:0 dropped:0 overruns:0 frame:0
          TX packets:10903 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:1000 
          RX bytes:9431240 (8.9 MiB)  TX bytes:1584348 (1.5 MiB)
          Interrupt:16 

tap0      Link encap:Ethernet  HWaddr 26:A1:36:5F:18:64  
          UP BROADCAST MULTICAST  MTU:1500  Metric:1
          RX packets:0 errors:0 dropped:0 overruns:0 frame:0
          TX packets:0 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:500 
          RX bytes:0 (0.0 b)  TX bytes:0 (0.0 b)
</pre>
<p>
这时候，网桥和tap设备都可以工作了，意味着qemu的网桥模式可以开始。
</p>

<p>
第三步 在qemu中使用网桥模式
</p>

<p>
使用过两种方式，
</p>

<p>
（1） 不设置启动脚本 
</p>
<pre class="example">
sudo qemu-kvm -hda CentOs5.7.img -net nic,macaddr=00:1d:92:ab:3f:78 -net tap,ifname=tap0,script=no,downscript=no -boot c
</pre>
<p>
这种方式，因为没有用到启动脚本(script=no,downscript=no),因此需要手动来使用上面的命令：
</p>
<pre class="example">
[abelard@localhost ~]$ brctl addif br0 tap0
[abelard@localhost ~]$ sudo ifconfig tap0 up
</pre>
<p>
（2） 设置qemu网络启动脚本/etc/qemu-ifup
</p>
<pre class="example">
#!/bin/sh
brctl addif br0 $1
ifconfig $1 up 0.0.0.0 promisc
</pre>
<p>
使用以下命令就可以启动guest os，并且可以在同一个子网中访问这个guest（192.168.0.81）
了，
</p>
<pre class="example">
sudo qemu-kvm -hda CentOs5.7.img -net nic,macaddr=00:1d:92:ab:3f:78 -net tap,ifname=tap0  -boot c
</pre>
<p>
或
</p>
<pre class="example">
sudo qemu-kvm -hda CentOs5.7.img -net nic,macaddr=00:00:00:00:00:00 -net tap,ifname=tap0 -boot c
</pre>
<p>
或
</p>
<pre class="example">
sudo qemu-kvm -hda CentOs5.7.img -net nic -net tap,ifname=tap0 -boot c
</pre>
</div>
</div>
