org/2014-09-19-linux-system-management.org
* 使用vnc来显示qemu客户OS
  + 需要在主机操作系统(如Fedora 12)上安装vnc服务器和客户端软件，如
    tigervnc,tigervnc-server
  + 使用带vnc参数启动qemu的客户操作系统
#+begin_example
[abelard@dillon vmware]$ sudo qemu-kvm -m 1G -hda Centos-mini.img -vnc 192.168.0.88:2  -boot c
#+end_example
    其中192.168.0.88为安装有vnc服务器软件的主机ip,‘:2’为端口号 ‘5900+2’
  + 在主机os上启动vnc客户端来显示客户os
#+begin_example
[abelard@dillon ~]$ vncviewer 192.168.0.88:5902
#+end_example

* 使用rsync命令从一台机器的内容同步到另一台机器时，会出现用户名和组名为数字
假设：从192.168.0.109 同步到 192.168.0.0.88上，在109上的信息是：
-rw-r--r-- 1 jiangshan jiangshan  2896 11月 22 08:11 README
同步到88上以后：
-rw-r--r-- 1 1000 1000  2896 11月 22 08:11 README

显示为1000的原理是：在109上jiangshan的用户名和组ID为1000，在同步到88的
时候，先去/etc/passwd上查找，如果有1000的用户，则显示为其用户名，没有
的话就显示数字。

这是因为在88的机器上没有用户和组为jiangshan的，为了同步以后保持原样，
在88上使用如下命令创建用户名：
useradd jiangshan -u 1000

再同步后，88上就变成和109上一样了。

* 为linux安装新的字体(环境为Fedora 12 x86_64)
参考：[[http://blog.csdn.net/evanlinux/article/details/5507343][Fedora12下安装微软雅黑字体 ]]
1. 先从windows下拷贝你需要的字体(目录为C:\windows\fonts),如
   simsun.ttc,simhei.ttf,或或从网上下载需要的字体，如apple的MONACO.ttf
   等宽字体， 将这些字体文件放在/usr/share/fonts/myFonts下，myFonts是
   自己建的目录。
2. 执行如下命令
#+begin_example
cd /usr/share/fonts/myFonts
mkfontscale
mkfontdir
fc-cache -fv
#+end_example
3. 打开“系统”——“首选项”——“观感”——“外观”，在字体选项卡中就可以找到“宋
   体，MONACO”等等了

* 架设dns服务器(环境为Fedora 12 x86_64)
参考 [[http://linux.vbird.org/linux_server/0350dns.php][第十九章、主機名稱控制者： DNS 伺服器]]
1. 先检查是否已安装相应的包
#+begin_example
[abelard@dillon ~]$ rpm -qa | grep '^bind'
bind-9.6.2-5.P2.fc12.x86_64
bind-libs-9.6.2-5.P2.fc12.x86_64
bind-utils-9.6.2-5.P2.fc12.x86_64
#+end_example
2.配置 /etc/named.conf
#+begin_example
options {
	//listen-on port 53 { any; };//any 代表全部接受
	//listen-on-v6 port 53 { ::1; };
	directory 	"/var/named";
	dump-file 	"/var/named/data/cache_dump.db";
        statistics-file "/var/named/data/named_stats.txt";
        memstatistics-file "/var/named/data/named_mem_stats.txt";
	allow-query     { any; };
	recursion yes;
	allow-transfer {any;}; //不许别人进行zone转移
};

logging {
        channel default_debug {
                file "data/named.run";
                severity dynamic;
        };
};

zone "." IN {
	type hint;
	file "named.ca";
};
zone "dillon.cloud" IN{ //新建的zone
	type master;
	file "named.dillon.cloud";
};

zone "0.168.192.in-addr.arpa" IN{ //新建的zone
  	type master;
	file "named.192.168.0";
};

include "/etc/named.rfc1912.zones";

#+end_example

3.新建/var/named/named.dillon.cloud

#+begin_example
$TTL 600
@	IN SOA master.dillon.cloud. cloud.www.dillon.cloud.(
	2011080401 3H 15M 1W 1D)
@	IN NS master.dillon.cloud.
master.dillon.cloud.	IN A 192.168.0.88
@	IN MX 10 www.dillon.cloud

www.dillon.cloud. IN A 192.168.0.88
#+end_example

4.新建/var/named/named.192.168.0
#+begin_example
$TTL 600
@ IN SOA master.dillon.cloud. cloud.www.dillon.cloud.(
	2011080401 3H 15M 1W 1D)
@ IN NS master.dillon.cloud.
88 IN PTR master.dillon.cloud.

88 IN PTR www.dillon.cloud
#+end_example

5.测试
5.1 开启bind
#+begin_example
[abelard@dillon ~]$ sudo /etc/init.d/named start
启动 named：                                               [确定]
#+end_example
如果希望每次系统自动启动named,使用
#+begin_example
[abelard@dillon ~]$ sudo chkconfig named on
#+end_example
5.2 为了使用自己的dns，在/etc/resolv.conf添加dns服务器的ip
#+begin_example
nameserver 192.168.0.88
#+end_example
5.3 测试正反解
#+begin_example
[abelard@dillon ~]$ nslookup 192.168.0.88
Server:		192.168.0.88
Address:	192.168.0.88#53

88.0.168.192.in-addr.arpa	name = master.dillon.cloud.
88.0.168.192.in-addr.arpa	name = www.dillon.cloud.0.168.192.in-addr.arpa.

[abelard@dillon ~]$ nslookup www.dillon.cloud
Server:		192.168.0.88
Address:	192.168.0.88#53

Name:	www.dillon.cloud
Address: 192.168.0.88
#+end_example
5.4 启动后，出现错误怎么办
查看
#+begin_example
[abelard@dillon ~]$ sudo tail -f -n 60 /var/log/messages 
#+end_example
* 查看已安装的perl模块
#+begin_example
#!/usr/bin/perl 

use ExtUtils::Installed; 
my $instmod = ExtUtils::Installed->new(); 
foreach my $module ($instmod->modules()) { 


my $version = $instmod->version($module) || "???"; 
printf( "%-12s — %s\n", $module, $version);
#print "$module -- $version\n"; 
} 
#+end_example

* 列出目前在cpan中可用的模块
执行如下命令：
#+begin_example
perl -MCPAN -e shell 
Terminal does not support AddHistory.

cpan shell -- CPAN exploration and modules installation (v1.9800)
Enter 'h' for help.

cpan[1]> m
#+end_example
* 安装perl模块(已安装MediaWikiDump为例)
有两种方式：手动和自动，自动的好处是那些依赖会自动安装，像Fedora的yum
一样，但是如果安装的过程中出错，没法知道错误的原因。

 + 下载 Parse-MediaWikiDump-1.0.6.tar.gz 并解压，之后执行如下命令
   
#+begin_example
>perl Makefile.PL
>make
>make test (optional)
>make install 
#+end_example

 + 自动安装
#+begin_example
#+begin_example
perl -MCPAN -e shell 
Terminal does not support AddHistory.

cpan shell -- CPAN exploration and modules installation (v1.9800)
Enter 'h' for help.

cpan[1]> install Parse::MediaWikiDump

#+end_example

* perl模块的卸载
+ 删除相关的pm文件就可以了
首先，使用下面的命令列出pm文件的可能位置，

#+begin_example
$ perl -e 'print join "\n",@INC'
/usr/local/lib64/perl5/site_perl/5.10.0/x86_64-linux-thread-multi
/usr/local/lib/perl5/site_perl/5.10.0
/usr/lib64/perl5/vendor_perl/5.10.0/x86_64-linux-thread-multi
/usr/lib/perl5/vendor_perl/5.10.0
/usr/lib/perl5/vendor_perl
/usr/lib64/perl5/5.10.0/x86_64-linux-thread-multi
/usr/lib/perl5/5.10.0
/usr/lib/perl5/site_perl
#+end_example
在这些位置里找到你关心的模块文件，比如version
#+begin_example
# ls /usr/lib64/perl5/5.10.0/x86_64-linux-thread-multi/version* -l
-r--r--r-- 1 root root 6494 12月 10 2010 /usr/lib64/perl5/5.10.0/x86_64-linux-thread-multi/version.pm
-r--r--r-- 1 root root 9816 11月 28 2010 /usr/lib64/perl5/5.10.0/x86_64-linux-thread-multi/version.pod

/usr/lib64/perl5/5.10.0/x86_64-linux-thread-multi/version:
总用量 32
-r--r--r-- 1 root root 24861  3月 11 2010 Internals.pod
-r--r--r-- 1 root root   505 12月 10 2010 vxs.pm
#+end_example
把这几个version相关的目录和文件删除就可以了
+ 
* 查看linux下某个端口被哪个程序占用,如想查看端口为5000被谁占用
使用命令：
#+begin_example
[abelard@dillon ~]$ netstat -tuanp | grep "5001"
#+end_example
* 用yum安装rpm文件
  如果rpm文件如AdobeReader_chs-8.1.7-1.i486.rpm，在Fedora 16
  x86_64的情况下，需要很多32位的依赖包，用rpm -ivh安装，会带
  来很多痛苦，用yum安装，所有依赖包，它会自己帮你去找
#+begin_example
 sudo yum install Downloads/AdobeReader_chs-8.1.7-1.i486.rpm 
#+end_example
* diff
If you are only interested to see the files that differ, you may use:

diff -qr dir_one dir_two | sort

Option "q" will only show the files that differ but not the content that differ, and "sort" will arrange the output alphabetically.
